tutorials/AileronBuzz/NACA65213_9k_M0839/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "";
    case "NACA65213";
    instance "0";
    local "";

    class volVectorField;
    object U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (285.50522868 0.0 0);

boundaryField
{
    inlet-outlet
    {
        type            fixedValue;
        value           uniform (285.50522868 0.0 0);
    }
    body
    {
        type            fixedValue;
        value           uniform (0.0 0.0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
