tutorials/AileronBuzz/NACA65213_9k_M0839/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/elisa/TESI/MESH_GENERATION";
    case "NACA65213";
    instance "constant";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
inlet-outlet
{
    type patch;
    physicalType supersonicInlet;
    nFaces 42;
    startFace 12897;
}

body
{
    type patch;
    physicalType transpiration;
    nFaces 300;
    startFace 12939;
}

defaultFaces
{
    type empty;
    physicalType empty;
    nFaces 17424;
    startFace 13239;
}
)

// ************************************************************************* //
